---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInDesignOptionWarn
source: html/e24de563-2c6c-add4-c433-0ddc4c753e6a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.ConfusingHostByElementsInDesignOptionWarn Property

An insert in the main model cannot be hosted by an element in a Design Option [--if you continue it will not be added to the design option set].

## Syntax (C#)
```csharp
public static FailureDefinitionId ConfusingHostByElementsInDesignOptionWarn { get; }
```